Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you have more than one optional dependency to declare in the `quarkus.package.jar.included-optional-dependencies` tag, make sure they are separated with `,` (e.g. `org.postgresql:postgresql::jar,com.foo:bar::jar`).
ja_jp: `quarkus.package.jar.included-optional-dependencies` タグで宣言するオプションの依存関係が複数ある場合は、 `,` で区切ってください (例: `org.postgresql:postgresql::jar,com.foo:bar::jar` )。

source: If you have multiple JDK's installed it is not certain Maven will pick up the expected java and you could end up with unexpected results. You can verify which JDK Maven uses by running `mvn --version`.
ja_jp: 複数の JDK をインストール済みで、Maven が意図した Java を使用するかわからない場合は、予期しない結果になることがあります。Maven が使用する JDK は、 `mvn --version` コマンドで確認できます。

source: If you have multiple JDK's installed, it is not certain Maven will pick up the expected java and you could end up with unexpected results. You can verify which JDK Maven uses by running `mvn --version`.
ja_jp: 複数の JDK がインストールされている場合、 Maven が意図した java を利用するとは限らず、予期しない結果になる可能性があります。 Maven がどの JDK を使用するかは、 `mvn --version` を実行することで確認することができます。

source: If you have not used <<project-creation,project scaffolding>>, add the following elements in your `pom.xml`
ja_jp: <<project-creation,プロジェクトのスキャフォールド>>を使用していない場合は、以下の要素を `pom.xml` に追加してください

source: If you have not used xref:project-creation[project scaffolding], add the following elements in your `pom.xml`
ja_jp: xref:project-creation[プロジェクトの足場] を使ったことがない場合は、以下の要素を `pom.xml` に追加してください:

source: If you have opted in and would like to disable build time analytics, you can do so in two ways:
ja_jp: オプトイン済みで、ビルド時解析を無効にしたい場合は、2つの方法があります：

source: If you have previously been running Docker on a version that did not support cgroups V2 on modern Linux distributions, a workaround setting the cgroups to V1 had to be enabled. This applied for Docker versions older than 19, included.
ja_jp: モダンなLinuxディストリビューションでcgroups V2をサポートしていないバージョンのDockerを実行していた場合、cgroupsをV1に設定する回避策を有効にする必要がありました。これは、19以前のDockerのバージョンが当てはまります。

source: If you have questions, you know https://quarkusio.zulipchat.com/#narrow/channel/187038-dev[where to find us], and if you find something interesting, please share it with us, we'd love to hear about it!
ja_jp: 質問がある場合は、 https://quarkusio.zulipchat.com/#narrow/channel/187038-dev[こちらのコミュニティー] でお待ちしています。また、何か面白いものを見つけたら、ぜひ共有してください。お話を聞けるのを楽しみにしています！

source: If you have some data that is known at build time (build time data) that you want to display, you can use one of the following builders in `Page`:
ja_jp: ビルド時に既知のデータ (ビルド時データ) を表示したい場合は、 `Page` で次のいずれかのビルダーを使用できます。

source: If you have some data that is known at build time that you want to display, you can use one of the following builders in `Page`:
ja_jp: ビルド時に表示したいデータがわかっている場合は、 `Page` で次のいずれかのビルダーを使用できます。

source: If you have started from the Getting Started example you should already have a completed test, including the correct `pom.xml` setup.
ja_jp: はじめにのサンプルから始めた場合は、正しい `pom.xml` の設定を含めて、すでにテストが完了しているはずです。

source: If you have started from the Getting Started example you should already have a completed test, including the correct tooling setup.
ja_jp: 「はじめに」のサンプルから始めた場合は、正しいツールマップの設定を含めて、 すでにテストが完了しているはずです。

source: If you have test suites which use multiple profiles or test resources, you should find that you no longer see duplicate containers active at the same time. The containers should launch one after the other.
ja_jp: 複数のプロファイルやテストリソースを使用するテストスイートがある場合、重複するコンテナーが同時にアクティブになることはなくなります。コンテナーは順番に起動するようになります。

source: If you have the `io.quarkus:quarkus-extension-processor` project open at the same time in your IDE (for example, if you have the Quarkus sources checked out and open in your IDE) you will need to close that project. Otherwise, Eclipse will not invoke the APT plugin that it contains.
ja_jp: IDEで同時に `io.quarkus:quarkus-extension-processor` プロジェクトを開いている場合（例えば、QuarkusのソースをチェックアウトしてIDEで開いている場合）、そのプロジェクトを閉じる必要があります。そうしないと、Eclipseはそのプロジェクトに含まれるAPTプラグインを起動しません。

source: If you have the `native-image` binary installed and `GRAALVM_HOME` set, or a container runtime (e.g., podman or docker) installed on Linux, you can get the native executable built and run using `jbang --native quarkusapp.java`:
ja_jp: `native-image` のバイナリがインストールされ、 `GRAALVM_HOME` が設定されているか、Linux にコンテナランタイム (podman や docker など) がインストールされていれば、 `jbang --native quarkusapp.java` を使ってネイティブ実行可能ファイルをビルドし、実行することができます。

source: If you have the `native-image` binary installed and `GRAALVM_HOME` set, you can get the native executable built and run using `jbang --native quarkusapp.java`:
ja_jp: `native-image` バイナリーがインストールされていて `GRAALVM_HOME` が設定されている場合は、 `jbang --native quarkusapp.java` を使用してネイティブ実行可能ファイルをビルドして実行することができます。

source: If you have the `upx` command available on your path, Quarkus uses it. Otherwise, if you built the native image using an in-container build (using `quarkus.native.container-build=true`) and if the builder image provides the `upx` command, Quarkus compresses the executable from inside the container.
ja_jp: パス上に `upx` コマンドがある場合は、Quarkusはそれを使用します。そうでない場合は、（ `quarkus.native.container-build=true` で）コンテナ内ビルドを使用してネイティブイメージを構築した場合、また、ビルダーイメージが `upx` コマンドを提供している場合、Quarkusはコンテナ内から実行ファイルを圧縮します。

source: If you have the `upx` command available on your path, Quarkus uses it. Otherwise, if you built the native image using an in-container build (using `quarkus.native.container-build=true`) and if the compression image provides the `upx` command, Quarkus compresses the executable from inside the container.
ja_jp: パス上に `upx` コマンドがある場合、Quarkus はそれを使用します。そうでない場合、コンテナー内ビルド ( `quarkus.native.container-build=true` を使用) でネイティブイメージをビルドし、圧縮イメージが `upx` コマンドを提供している場合は、Quarkus はコンテナー内から実行可能ファイルを圧縮します。

source: If you have the xref:flyway.adoc[Flyway extension] installed when running in development mode, Quarkus provides a simple way to initialize your Flyway configuration using the schema generated automatically by Hibernate ORM. This is intended to ease the move from the early development phase, where Hibernate can be used to quickly set up the schema, to the production phase, where Flyway is used to manage schema changes.
ja_jp: 開発モードでで実行している際に xref:flyway.adoc[Flyway エクステンション] をインストールしている場合、 Quarkus は Hibernate ORM によって自動的に生成されたスキーマを使用して Flyway の設定を簡単に初期化する方法を提供します。 これは、Hibernate を使ってスキーマを迅速にセットアップできる初期開発段階から、 Flyway を使ってスキーマの変更を管理する実稼働段階への移行を 容易にすることを目的としています。

source: If you have the xref:flyway.adoc[Flyway extension] installed when running in development mode, Quarkus provides a simple way to initialize your Flyway configuration using the schema generated automatically by Hibernate Reactive.
ja_jp: 開発モードで実行しているときに xref:flyway.adoc[Flywayエクステンション] がインストールされている場合、Quarkusには、Hibernate Reactiveによって自動的に生成されたスキーマを使用してFlyway設定を初期化する簡単な方法があります。

source: If you have the xref:flyway.adoc[Flyway extension] installed when running in development mode, Quarkus provides a simple way to turn your Hibernate ORM auto generated schema into a Flyway migration file. This is intended to make is easy to move from the early development phase, where Hibernate can be used to quickly set up the schema, to the production phase, where Flyway is used to manage schema changes.
ja_jp: 開発モードで実行しているときに xref:flyway.adoc[Flywayエクステンション]がインストールされている場合、QuarkusはHibernate ORMで自動生成されたスキーマをFlyway移行ファイルに変換する簡単な方法を提供します。これは、Hibernateを使用してスキーマを迅速にセットアップする開発初期段階から、Flywayを使用してスキーマの変更を管理する本番段階への移行を容易にすることを目的としています。

source: If you have the xref:flyway.adoc[Flyway extension] installed when running in development mode, Quarkus provides a simple way to turn your Hibernate ORM auto generated schema into a Flyway migration file. This is intended to make is easy to move from the early development phase, where Hibernate can be used to quickly setup the schema, to the production phase, where Flyway is used to manage schema changes.
ja_jp: 開発モードで実行しているときに xref:flyway.adoc[Flywayエクステンション] がインストールされている場合、Quarkusは、Hibernate ORMで自動生成されたスキーマをFlywayマイグレーションファイルに変換する簡単な方法を提供します。これは、Hibernateを使用してスキーマをすばやくセットアップする初期の開発フェーズから、Flywayを使用してスキーマの変更を管理する本番フェーズへの移行を容易にすることを目的としています。

source: If you have to test Quarkus OIDC service endpoints that require xref:security-keycloak-authorization.adoc[Keycloak authorization], follow the xref:security-keycloak-authorization.adoc#testing[Test Keycloak authorization] section.
ja_jp: xref:security-keycloak-authorization.adoc[Keycloak 認証] を必要とする Quarkus OIDC サービスエンドポイントをテストする必要がある場合は、xref:security-keycloak-authorization.adoc#testing[Keycloak 認証のテスト] セクションに従ってください。

source: If you haven't already created your function up at azure, the will build an uber-jar, package it, create the function at Azure, and deploy it.
ja_jp: あなたがまだ Azure で Function を作成していない場合は、uber-jar をビルドしてパッケージ化し、Azure で Function を作成してデプロイします。

source: If you haven't already created your function up at azure, then build an uber-jar, package it, create the function at Azure, and deploy it.
ja_jp: あなたがまだ Azure で Function を作成していない場合は、uber-jar をビルドしてパッケージ化し、Azure で Function を作成してデプロイします。

source: If you haven't done yet, start your application with `mvn clean quarkus:dev`;
ja_jp: まだの場合は、 `mvn clean quarkus:dev` を使用してアプリケーションを起動します。

source: If you haven't seen the blog post on https://quarkus.io/blog/vscode-quarkus-1.10.0[Quarkus Tools for Visual Studio Code - 1.10.0 release], we suggest you take a look at the marvelous features we've introduced in this long awaited release.
ja_jp: link:https://quarkus.io/blog/vscode-quarkus-1.10.0[Quarkus Tools for Visual Studio Code - 1.10.0リリース] に関するブログポストをまだご覧になっていない方は、この待望のリリースで導入された素晴らしい機能をご覧ください。

source: If you implemented a custom `HttpAuthenticationMechanism`, then you need to add the `RoutingContext` to the authentication request attributes with the `io.quarkus.vertx.http.runtime.security.HttpSecurityUtils.setRoutingContextAttribute` method call. Otherwise, the `RoutingContext` will not be available during augmentation.
ja_jp: カスタム `HttpAuthenticationMechanism` を実装した場合は、 `io.quarkus.vertx.http.runtime.security.HttpSecurityUtils.setRoutingContextAttribute` メソッド呼び出しで認証リクエスト属性に `RoutingContext` を追加する必要があります。 そうしないと、オーグメンテーション中に `RoutingContext` を使用できなくなります。

source: If you include the jpa-modelgen annotation processor this will exclude the Panache annotation processor by default. If you do this you should either create the marker file yourself, or add the `quarkus-panache-common` as well, as shown below:
ja_jp: jpa-modelgenアノテーションプロセッサーをインクルードすると、デフォルトでPanacheアノテーションプロセッサが除外されます。この場合はマーカーファイルを自分で作成するか、以下のように `quarkus-panache-common` を追加する必要があります:

source: If you included the UI in your app (`quarkus.swagger-ui.always-include=true`), you can now disable it when starting the application.
ja_jp: アプリにUIが含まれている場合( `quarkus.swagger-ui.always-include=true` )、アプリ起動時にUIを無効にできるようになりました。

source: If you install the https://vale.sh/docs/vale-cli/installation/[Vale CLI], you must specify the configuration file and the directory or list of files to scan:
ja_jp: link:https://vale.sh/docs/vale-cli/installation/[Vale CLI] をインストールした場合、設定ファイルとスキャンするファイルのディレクトリまたはリストを指定する必要があります:

source: If you install xref:ide-tooling.adoc[Quarkus IDEs plugins], you will have autocompletion, link to implementation and validation.
ja_jp: xref:ide-tooling.adoc[Quarkus IDE プラグイン] をインストールすると、自動補完、実装へのリンク、検証が利用できるようになります。

source: If you installed GraalVM, you can link:https://quarkus.io/guides/building-native-image[build a native image] using:
ja_jp: GraalVM をインストールした場合は、以下を使用して、 link:https://quarkus.io/guides/building-native-image[ネイティブイメージのビルド] が可能です。

source: If you installed GraalVM, you can xref:building-native-image.adoc[build a native image] using:
ja_jp: GraalVMをインストールした場合は、以下の方法で xref:building-native-image.adoc[ネイティブ・イメージをビルド] できる：

source: If you instead want to just run in Java mode, that's totally possible: just skip the native-image build and run it as a jar.
ja_jp: その代わりに Java モードで実行したい場合は、ネイティブイメージのビルドをスキップして jar として実行することも可能です。

source: If you just closed the extension processor project, be sure to do `Maven > Update Project` on the other projects in order for Eclipse to pick up the extension processor from the Maven repository.
ja_jp: エクステンションプロセッサのプロジェクトを閉じたばかりの場合は、Eclipse が Maven リポジトリからエクステンションプロセッサをピックアップするために、他のプロジェクトで `Maven > Update Project` を必ず実行してください。

source: If you just launch `mvn io.quarkus.platform:quarkus-maven-plugin:{quarkus-version}:create` the Maven plugin asks for user inputs. You can disable this interactive mode (and use default values) by passing `-B` to the Maven command.
ja_jp: `mvn io.quarkus.platform:quarkus-maven-plugin:{quarkus-version}:create` を単に起動すると、Maven プラグインはユーザー入力を求めます。Mavenコマンドに `-B` を渡すことで、このインタラクティブモードを無効にする(およびデフォルト値を使用する)ことができます。

source: If you just launch `mvn {quarkus-platform-groupid}:quarkus-maven-plugin:{quarkus-version}:create` the Maven plugin asks for user inputs. You can disable this interactive mode (and use default values) by passing `-B` to the Maven command.
ja_jp: `mvn {quarkus-platform-groupid}:quarkus-maven-plugin:{quarkus-version}:create` を起動すると、Maven プラグインはユーザー入力を求めます。Mavenコマンドに `-B` を渡すことで、このインタラクティブモードを無効にしてデフォルト値を使用できます。

source: If you just want to examine the code, you can fast-forward to the completed example by using one of the following ways:
ja_jp: コードを確かめるだけなら、次のいずれかの方法で、完成例まで早送りすることができます:

source: If you know of a cool article, blog or video that we are missing, please <a href="https://github.com/quarkusio/quarkusio.github.io" target="blank"> submit an issue</a>.
ja_jp: 私たちが見逃しているクールな記事、ブログ、ビデオをご存知でしたら、ぜひ<a href="https://github.com/quarkusio/quarkusio.github.io" target="blank"> ご投稿</a>ください。

source: If you like, use your container tool to see what containers are running. For example, if you're using Docker, run `docker ps`, and for podman, run `podman ps`. You should see something like the following:
ja_jp: 必要に応じて、コンテナーツールを使用し、実行中のコンテナーを確認します。 たとえば、Docker を使用している場合は `docker ps` を実行し、podman の場合は `podman ps` を実行します。 以下のように表示されるはずです。

source: If you look at either file you will see that it contains a Knative `Service`.
ja_jp: どちらかのファイルを見ると、Knative `Service` が含まれることが確認できます。

source: If you look at either file you will see that it contains both a Kubernetes `Deployment` and a `Service`.
ja_jp: どちらのファイルを見ても、Kubernetes `Deployment` と `Service` 両方が含まれていることに気づくでしょう。

source: If you look at the Java code, you'll see that there is no HTTP specific API. Its just simple Java methods annotated with `@Funq`. Simple, easy, straightforward.
ja_jp: Javaコードを見ると、HTTP固有のAPIがないことがわかります。単純な Java メソッドに `@Funq` とアノテーションが付けられているだけです。シンプルで、簡単で、わかりやすいです。

source: If you look at the XmlConfig code you will see that it does carry around the JAXB annotations. If you don't want these in the runtime image, you could clone the XmlConfig instance into some POJO object graph and then replace XmlConfig with the POJO class. We will do this in <<replacing-classes-in-native-image>>.
ja_jp: XmlConfig コードを見ると、JAXB アノテーションが付与されていることがわかります。これらをランタイムイメージに含めたくない場合は、XmlConfig インスタンスを POJO オブジェクトグラフに複製してから、XmlConfig を POJO クラスに置き換えることができます。これは、<<replacing-classes-in-native-image>> で行います。

source: If you look at the XmlConfig code you will see that it does carry around the JAXB annotations. If you don't want these in the runtime image, you could clone the XmlConfig instance into some POJO object graph and then replace XmlConfig with the POJO class. We will do this in xref:replacing-classes-in-native-image[Replacing Classes in the Native Image].
ja_jp: XmlConfig のコードを見ると、JAXB アノテーションを持ち運んでいることがわかります。実行時イメージにこれらのアノテーションが必要ない場合は、XmlConfigインスタンスを何らかのPOJOオブジェクトグラフにクローンし、XmlConfigをPOJOクラスで置き換えることができます。これは、 xref:replacing-classes-in-native-image[ネイティブ・イメージのクラスの置換] で行う予定です。

source: If you look at the XmlConfig code you will see that it does carry around the JAXB annotations. If you don't want these in the runtime image, you could clone the XmlConfig instance into some POJO object graph and then replace XmlConfig with the POJO class. We will do this in <<Replacing Classes in the Native Image>>.
ja_jp: XmlConfig コードを見ると、JAXB アノテーションがあることがわかります。これらをランタイムイメージに含めたくない場合は、XmlConfig インスタンスを POJO オブジェクトグラフに複製してから、XmlConfig を POJO クラスに置き換えることができます。これは <<ネイティブイメージにおいてクラスを置換する>> で行います。

source: If you look at the link:{quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/pom.xml[POM], you'll see that it is a typical Quarkus POM that pulls in one Funqy dependency:
ja_jp: link:{quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/pom.xml[POM] を見ると、典型的なQuarkusのPOMで、Funqyの依存関係を1つ取り込んでいることがわかります：

source: If you look at the three generated handler classes in the project, you'll see that they are `@Named` differently.
ja_jp: プロジェクト内で生成された3つのハンドラークラスを見てみると、異なる `@Named` が指定されていることがわかります。

source: If you look at the {quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/pom.xml[POM], you'll see that it is a typical Quarkus POM that pulls in one Funqy dependency:
ja_jp: {quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/pom.xml[POM]を見ると、Funqyの依存関係を1つ取り込んだ典型的なQuarkusのPOMであることがわかります。

source: If you make use of the CLI, please provide us your feedback either in https://github.com/quarkusio/quarkus/issues[our tracker] or in https://github.com/quarkusio/quarkus/issues[the discussions area].
ja_jp: CLIをお使いの方は、 link:https://github.com/quarkusio/quarkus/issues[トラッカー]または link:https://github.com/quarkusio/quarkus/issues[ディスカッション・エリア]でご意見をお聞かせください。

source: If you modify the `path` or add a `routePrefix` within the `azure-config/function.json` deployment descriptor, your code or configuration must also reflect any prefixes you specify for your path.
ja_jp: `path` を変更したり、 `azure-config/function.json` デプロイメントディスクリプタ内に `routePrefix` を追加したりする場合、コードや設定にはパスに指定した接頭辞も反映させる必要があります。

source: If you must request a UserInfo JSON object from the OIDC `UserInfo` endpoint, set `quarkus.oidc.authentication.user-info-required=true`. A request is sent to the OIDC provider `UserInfo` endpoint, and an `io.quarkus.oidc.UserInfo` (a simple `javax.json.JsonObject` wrapper) object is created. `io.quarkus.oidc.UserInfo` can be injected or accessed as a `SecurityIdentity` `userinfo` attribute.
ja_jp: OIDC `UserInfo` エンドポイントから UserInfo JSON オブジェクトをリクエストする必要がある場合は、 `quarkus.oidc.authentication.user-info-required=true` を設定します。 OIDC プロバイダーの `UserInfo` エンドポイントにリクエストが送信され、 `io.quarkus.oidc.UserInfo` (単純な `javax.json.JsonObject` ラッパー) オブジェクトが作成されます。 `io.quarkus.oidc.UserInfo` は、 `SecurityIdentity` `userinfo` 属性として注入またはアクセスできます。

source: If you navigate to the <<dev-ui-all-oidc-providers>>, you can log into the OIDC server as builtin users `alice` or `bob`:
ja_jp: <<dev-ui-all-oidc-providers>> に移動すると、組み込みユーザー `alice` または `bob` として OIDC サーバーにログインできます。

source: If you need SSL support in your native executable, you can easily include the necessary libraries in your Docker image.
ja_jp: ネイティブ実行可能ファイルにSSLサポートが必要な場合は、Dockerイメージに必要なライブラリを簡単に含めることができます。

source: If you need a clustered scheduler use the xref:quartz.adoc[Quartz extension].
ja_jp: クラスター化されたスケジューラーが必要な場合は、 link:quartz[Quartzエクステンション] を使用してください。

source: If you need a lightweight library for the remote introspection of opaque or JWT tokens, use `quarkus-elytron-security-oauth2`.
ja_jp: 不透明トークンや JWT トークンのリモートイントロスペクションのための軽量なライブラリーが必要な場合は、 `quarkus-elytron-security-oauth2` を使用してください。

source: If you need a more advanced configuration, you can find the comprehensive list of supported configuration properties at the end of this guide.
ja_jp: より高度な設定が必要な場合は、このガイドの最後に、サポートされている設定プロパティーの包括的なリストがあります。

source: If you need a more dynamic configuration for the different tenants you want to support and don't want to end up with multiple entries in your configuration file, you can use the `io.quarkus.oidc.TenantConfigResolver`.
ja_jp: サポートするさまざまなテナントに対して、より動的な設定が必要で、設定ファイルに複数のエントリーを入れたくない場合は、 `io.quarkus.oidc.TenantConfigResolver` を利用できます。

source: If you need a more dynamic configuration for the different tenants you want to support and don't want to end up with multiple entries in your configuration file, you can use the `io.quarkus.hibernate.orm.runtime.tenant.TenantConnectionResolver` interface to implement your own logic for retrieving a connection. Creating an application-scoped bean that implements this interface and annotating it with `@PersistenceUnitExtension` (or `@PersistenceUnitExtension("nameOfYourPU")` for a <<multiple-persistence-units,named persistence unit>>) will replace the current Quarkus default implementation `io.quarkus.hibernate.orm.runtime.tenant.DataSourceTenantConnectionResolver`. Your custom connection resolver would allow for example to read tenant information from a database and create a connection per tenant at runtime based on it.
ja_jp: サポートするテナントごとにより動的な設定が必要で、設定ファイルに複数のエントリーを追加したくない場合は、 `io.quarkus.hibernate.orm.runtime.tenant.TenantConnectionResolver` インターフェイスを使用して、接続を取得する独自のロジックを実装できます。 このインターフェースを実装するアプリケーションスコープの Bean を作成し、 `@PersistenceUnitExtension` (または <<multiple-persistence-units,named persistence unit>> の場合は `@PersistenceUnitExtension("nameOfYourPU")` のアノテーションをを付与すると、 Quarkus のデフォルト実装 `io.quarkus.hibernate.orm.runtime.tenant.DataSourceTenantConnectionResolver` を置き換えます。 カスタム接続リゾルバーを使用すると、たとえば、テナント情報をデータベースから読み取り、それに基づいてテナントごとに実行時に接続を作成することが可能になります。

source: If you need a more dynamic configuration for the different tenants you want to support and don't want to end up with multiple entries in your configuration file, you can use the `io.quarkus.hibernate.orm.runtime.tenant.TenantConnectionResolver` interface to implement your own logic for retrieving a connection. Creating an application-scoped bean that implements this interface and annotating it with `@PersistenceUnitExtension` (or `@PersistenceUnitExtension("nameOfYourPU")` for a xref:multiple-persistence-units[named persistence unit]) will replace the current Quarkus default implementation `io.quarkus.hibernate.orm.runtime.tenant.DataSourceTenantConnectionResolver`. Your custom connection resolver would allow for example to read tenant information from a database and create a connection per tenant at runtime based on it.
ja_jp: サポートするテナントに応じてより動的な設定が必要で、設定ファイルに複数のエントリーを追加したくない場合は、 `io.quarkus.hibernate.orm.runtime.tenant.TenantConnectionResolver` インターフェースを使用して、接続を取得するための独自のロジックを実装することができます。このインターフェースを実装するアプリケーションスコープ付きBeanを作成し、 `@PersistenceUnitExtension` （または xref:multiple-persistence-units[名前付き永続化ユニット] の場合は `@PersistenceUnitExtension("nameOfYourPU")` ）でアノテーションすると、現在のQuarkusのデフォルト実装 `io.quarkus.hibernate.orm.runtime.tenant.DataSourceTenantConnectionResolver` が置き換えられます。カスタム接続リゾルバを使用すると、たとえば、データベースからテナント情報を読み取り、それに基づいて実行時にテナントごとの接続を作成することができます。

source: If you need access to all uploaded files for all parts regardless of their names, you can do it with `@RestForm(FileUpload.ALL) List<FileUpload>`.
ja_jp: 名前に関係なく、アップロードされたすべてのファイルのすべてのパーツにアクセスする必要がある場合は、 `@RestForm(FileUpload.ALL) List<FileUpload>` で実現できます。

source: If you need different configurations for each signal, you can use the specific properties:
ja_jp: シグナルごとに異なる設定が必要な場合は、特定のプロパティを使用できます：

source: If you need different header values depending on the path, you can use the following configuration:
ja_jp: パスによって異なるヘッダー値が必要な場合は、以下のように設定することができます。

source: If you need fine-grain control, or execute commands in a generic way: use `io.vertx.mutiny.redis.client.RedisAPI`
ja_jp: 細かい制御が必要な場合や、汎用的な方法でコマンドを実行する場合は、 `io.vertx.mutiny.redis.client.RedisAPI` を使用します。

source: If you need health checks globally enabled in your application, but don't want to activate Cassandra health checks, you can disable Cassandra health checks by setting the `quarkus.cassandra.health.enabled` property to `false` in your `application.properties`.
ja_jp: アプリケーションでヘルスチェックをグローバルに有効にする必要があるが、Cassandra ヘルスチェックは有効にしない場合は、 `application.properties` で `quarkus.cassandra.health.enabled` プロパティーを `false` に設定して Cassandra ヘルスチェックを無効にできます。
